stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
/**
  ******************************************************************************
  * @file    stm32wl3x_ll_adc.h
  * @author  GPM Application Team
  * @brief   Header file of ADC LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WL3x_LL_ADC_H
#define STM32WL3x_LL_ADC_H

#ifdef __cplusplus
extern "C" {
#endif /* __cpluplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x.h"

/** @addtogroup STM32WL3x_LL_Driver
  * @{
  */

#if defined (ADC1)

/** @defgroup ADC_LL ADC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup ADC_LL_Private_Constants ADC Private Constants
  * @{
  */

/* Internal mask for ADC sequencer:                                           */
/* To select into literal LL_ADC_RANK_x the relevant bits for:                */
/* - sequencer register offset                                                */
/* - sequencer rank bits position into the selected register                  */

/* Internal register offset for ADC sequencer configuration */
/* (offset placed into a spare area of literal definition)  */
#define ADC_SEQ_1_REGOFFSET                 (0x00000000UL)
#define ADC_SEQ_2_REGOFFSET                 (0x00000100UL)

#define ADC_SEQ_X_REGOFFSET_MASK        (ADC_SEQ_1_REGOFFSET | ADC_SEQ_2_REGOFFSET)
#define ADC_SEQ_X_REGOFFSET_POS         (8UL) /* Position of bits ADC_SEQ_x_REGOFFSET in ADC_REG_SEQ_X_REGOFFSET_MASK*/
#define ADC_RANK_ID_SEQ_X_MASK          (0xFFUL)

/* Definition of ADC sequencer bits information to be inserted  */
/* into ADC sequencer ranks literals definition.                */
#define ADC_RANK_1_SEQ_X_BITOFFSET_POS   (ADC_SEQ_1_SEQ0_Pos)
#define ADC_RANK_2_SEQ_X_BITOFFSET_POS   (ADC_SEQ_1_SEQ1_Pos)
#define ADC_RANK_3_SEQ_X_BITOFFSET_POS   (ADC_SEQ_1_SEQ2_Pos)
#define ADC_RANK_4_SEQ_X_BITOFFSET_POS   (ADC_SEQ_1_SEQ3_Pos)
#define ADC_RANK_5_SEQ_X_BITOFFSET_POS   (ADC_SEQ_1_SEQ4_Pos)
#define ADC_RANK_6_SEQ_X_BITOFFSET_POS   (ADC_SEQ_1_SEQ5_Pos)
#define ADC_RANK_7_SEQ_X_BITOFFSET_POS   (ADC_SEQ_1_SEQ6_Pos)
#define ADC_RANK_8_SEQ_X_BITOFFSET_POS   (ADC_SEQ_1_SEQ7_Pos)
#define ADC_RANK_9_SEQ_X_BITOFFSET_POS   (ADC_SEQ_2_SEQ8_Pos)
#define ADC_RANK_10_SEQ_X_BITOFFSET_POS   (ADC_SEQ_2_SEQ9_Pos)
#define ADC_RANK_11_SEQ_X_BITOFFSET_POS  (ADC_SEQ_2_SEQ10_Pos)
#define ADC_RANK_12_SEQ_X_BITOFFSET_POS  (ADC_SEQ_2_SEQ11_Pos)
#define ADC_RANK_13_SEQ_X_BITOFFSET_POS  (ADC_SEQ_2_SEQ12_Pos)
#define ADC_RANK_14_SEQ_X_BITOFFSET_POS  (ADC_SEQ_2_SEQ13_Pos)
#define ADC_RANK_15_SEQ_X_BITOFFSET_POS  (ADC_SEQ_2_SEQ14_Pos)
#define ADC_RANK_16_SEQ_X_BITOFFSET_POS  (ADC_SEQ_2_SEQ15_Pos)

static const uint8_t ADC_CHANNEL_SWITCH_POS_LUT[12] =
{
  (uint8_t)(ADC_SWITCH_SE_VIN_0_Pos),      /*!< ADC_SWITCH_SE_VIN_0 Channel ADC_INM0 */
  (uint8_t)(ADC_SWITCH_SE_VIN_1_Pos),      /*!< ADC_SWITCH_SE_VIN_1 Channel ADC_INM1 */
  (uint8_t)(ADC_SWITCH_SE_VIN_2_Pos),      /*!< ADC_SWITCH_SE_VIN_2 Channel ADC_INM2 */
  (uint8_t)(ADC_SWITCH_SE_VIN_3_Pos),      /*!< ADC_SWITCH_SE_VIN_3 Channel ADC_INM3 */
  (uint8_t)(ADC_SWITCH_SE_VIN_4_Pos),      /*!< ADC_SWITCH_SE_VIN_4 Channel ADC_INP1 */
  (uint8_t)(ADC_SWITCH_SE_VIN_5_Pos),      /*!< ADC_SWITCH_SE_VIN_5 Channel ADC_INP2 */
  (uint8_t)(ADC_SWITCH_SE_VIN_6_Pos),      /*!< ADC_SWITCH_SE_VIN_6 Channel ADC_INP3 */
  (uint8_t)(ADC_SWITCH_SE_VIN_7_Pos),      /*!< ADC_SWITCH_SE_VIN_7 Channel ADC_INP4 */
  (uint8_t)(ADC_SWITCH_SE_VIN_0_Pos),      /*!< ADC_SWITCH_SE_VIN_0 Channel ADC_INP1 - ADC_INM1 */
  (uint8_t)(ADC_SWITCH_SE_VIN_1_Pos),      /*!< ADC_SWITCH_SE_VIN_1 Channel ADC_INP2 - ADC_INM2 */
  (uint8_t)(ADC_SWITCH_SE_VIN_2_Pos),      /*!< ADC_SWITCH_SE_VIN_2 Channel ADC_INP3 - ADC_INM3 */
  (uint8_t)(ADC_SWITCH_SE_VIN_3_Pos),      /*!< ADC_SWITCH_SE_VIN_3 Channel ADC_INP4 - ADC_INM4 */
};

#define TEMPSENSOR_TCK_ADDR               ((uint32_t*) (0x10001E5CUL)) /* Internal temperature sensor, address of
                                           parameter TCK: TCK is the chuck temperature in 0.1DegC (e.g. 30DegC = 300) */
#define TEMPSENSOR_C30_ADDR               ((uint32_t*) (0x10001E60UL)) /* Internal temperature sensor, address of
                                           parameter C30: On this STM32 series, temperature sensor ADC raw data
                                           acquired at temperature 30 DegC. */

#define TEMPSENSOR_C30_TEMP                (30UL)                      /* Internal temperature sensor, temperature
                                           at which temperature sensor has been calibrated in production for data
                                           into TEMPSENSOR_C30_ADDR (tolerance: +-5 DegC) (unit: DegC). */

/** @defgroup ADC_LL_CALIB_ADDRESS ADC calibration points location
  * @brief    Defines the memory address of the calibration points.
  * @{
  */
#define ADC_LAYOUT_ID                    (0x10001EFCUL)
#define ADC_CALIB_ADDRESS_VINPX_3V6      (0x10001E20UL)
#define ADC_CALIB_ADDRESS_VINMX_3V6      (0x10001E1CUL)
#define ADC_CALIB_ADDRESS_VINDIFF_3V6    (0x10001E18UL)
#define ADC_CALIB_ADDRESS_VINPX_2V4      (0x10001E14UL)
#define ADC_CALIB_ADDRESS_VINMX_2V4      (0x10001E10UL)
#define ADC_CALIB_ADDRESS_VINDIFF_2V4    (0x10001E0CUL)
#define ADC_CALIB_ADDRESS_VINPX_1V2      (0x10001E08UL)
#define ADC_CALIB_ADDRESS_VINMX_1V2      (0x10001E04UL)
#define ADC_CALIB_ADDRESS_VINDIFF_1V2    (0x10001E00UL)

/**
  * @}
  */

/* Uncomment this symbol to use the version with floating point of the conversion functions */
#define BLE_ADC_OUTPUT_FLOAT

/**
  * @}
  */


