stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
  uint32_t ChannelForSeq1;              /*!< Set the channel number code for the 2nd conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq2;              /*!< Set the channel number code for the 3rd conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq3;              /*!< Set the channel number code for the 4th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq4;              /*!< Set the channel number code for the 5th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq5;              /*!< Set the channel number code for the 6th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq6;              /*!< Set the channel number code for the 7th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq7;              /*!< Set the channel number code for the 8th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq8;              /*!< Set the channel number code for the 9th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq9;              /*!< Set the channel number code for the 10th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq10;             /*!< Set the channel number code for the 11th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq11;             /*!< Set the channel number code for the 12th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq12;             /*!< Set the channel number code for the 13th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq13;             /*!< Set the channel number code for the 14th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq14;             /*!< Set the channel number code for the 15th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

  uint32_t ChannelForSeq15;             /*!< Set the channel number code for the 16th conversion of the sequence.
                                             This parameter can be a value of @ref ADC_LL_CHANNEL
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_SetSequencerRanks(). */

} LL_ADC_SequenceInitTypeDef;

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/


