stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
/** @defgroup ADC_LL_INPUT_VOLTAGE_RANGE ADC input voltage range definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetChannelVoltageRange()
  *           and @ref LL_ADC_GetChannelVoltageRange()
  * @{
  */

#define LL_ADC_VIN_RANGE_1V2    (0UL)  /*!< ADC input voltage range up to 1.2 V */
#define LL_ADC_VIN_RANGE_2V4    (2UL)  /*!< ADC input voltage range up to 2.4 V */
#define LL_ADC_VIN_RANGE_3V6    (3UL)  /*!< ADC input voltage range up to 3.6 V */

/**
  * @}
  */


/** @defgroup ADC_LL_DEFAULT_RANGE_VALUE ADC default range value definitions
  * @brief    It defines the parameters used as default range value
  * @{
  */

#define LL_ADC_DEFAULT_RANGE_VALUE_1V2    (0xFFFUL)  /*!< ADC default range value up to 1.2 V */
#define LL_ADC_DEFAULT_RANGE_VALUE_2V4    (0x7FFUL)  /*!< ADC default range value up to 2.4 V */
#define LL_ADC_DEFAULT_RANGE_VALUE_3V6    (0x555UL)  /*!< ADC default range value up to 3.6 V */

/**
  * @}
  */


/** @defgroup ADC_LL_DS_DATA_WIDTH ADC Down Sampler data width definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetDSDataOutputWidth()
  *           and @ref LL_ADC_GetDSDataOutputWidth()
  * @{
  */

#define LL_ADC_DS_DATA_WIDTH_12_BIT  (0UL)  /*!< ADC Down Sampler data width 12 bits */
#define LL_ADC_DS_DATA_WIDTH_13_BIT  (1UL)  /*!< ADC Down Sampler data width 13 bits */
#define LL_ADC_DS_DATA_WIDTH_14_BIT  (2UL)  /*!< ADC Down Sampler data width 14 bits */
#define LL_ADC_DS_DATA_WIDTH_15_BIT  (3UL)  /*!< ADC Down Sampler data width 15 bits */
#define LL_ADC_DS_DATA_WIDTH_16_BIT  (4UL)  /*!< ADC Down Sampler data width 16 bits */

/**
  * @}
  */


/** @defgroup ADC_LL_DS_RATIO ADC Down Sampler ratio definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetDSDataOutputRatio()
  *           and @ref LL_ADC_GetDSDataOutputRatio()
  * @{
  */

#define LL_ADC_DS_RATIO_1    (0UL)          /*!< ADC Down Sampler ratio 1, no down sampling (default) */
#define LL_ADC_DS_RATIO_2    (1UL)          /*!< ADC Down Sampler ratio 2                             */
#define LL_ADC_DS_RATIO_4    (2UL)          /*!< ADC Down Sampler ratio 4                             */
#define LL_ADC_DS_RATIO_8    (3UL)          /*!< ADC Down Sampler ratio 8                             */
#define LL_ADC_DS_RATIO_16   (4UL)          /*!< ADC Down Sampler ratio 16                            */
#define LL_ADC_DS_RATIO_32   (5UL)          /*!< ADC Down Sampler ratio 32                            */
#define LL_ADC_DS_RATIO_64   (6UL)          /*!< ADC Down Sampler ratio 64                            */
#define LL_ADC_DS_RATIO_128  (7UL)          /*!< ADC Down Sampler ratio 128                           */

/**
  * @}
  */


/** @defgroup ADC_LL_CHANNEL ADC channel number code for conversion definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetSequencerRanks()
  * @{
  */

#define LL_ADC_CHANNEL_VINM0             (0x00UL)  /*!< ADC channel for VINM0 to single negative input */
#define LL_ADC_CHANNEL_VINM1             (0x01UL)  /*!< ADC channel for VINM1 to single negative input */
#define LL_ADC_CHANNEL_VINM2             (0x02UL)  /*!< ADC channel for VINM2 to single negative input */
#define LL_ADC_CHANNEL_VINM3             (0x03UL)  /*!< ADC channel for VINM3 to single negative input */
#define LL_ADC_CHANNEL_VINP0             (0x04UL)  /*!< ADC channel for VINP0 to single positive input */
#define LL_ADC_CHANNEL_VINP1             (0x05UL)  /*!< ADC channel for VINP1 to single positive input */
#define LL_ADC_CHANNEL_VINP2             (0x06UL)  /*!< ADC channel for VINP2 to single positive input */
#define LL_ADC_CHANNEL_VINP3             (0x07UL)  /*!< ADC channel for VINP3 to single positive input */
#define LL_ADC_CHANNEL_VINP0_VINM0       (0x08UL)  /*!< ADC channel for VINP0 - VINM0 to differential input */
#define LL_ADC_CHANNEL_VINP1_VINM1       (0x09UL)  /*!< ADC channel for VINP1 - VINM1 to differential input */
#define LL_ADC_CHANNEL_VINP2_VINM2       (0x0AUL)  /*!< ADC channel for VINP2 - VINM2 to differential input */
#define LL_ADC_CHANNEL_VINP3_VINM3       (0x0BUL)  /*!< ADC channel for VINP3 - VINM3 to differential input */
#define LL_ADC_CHANNEL_VBAT              (0x0CUL)  /*!< ADC channel for VBAT, battery level detector */
#define LL_ADC_CHANNEL_TEMPSENSOR        (0x0DUL)  /*!< ADC channel for temperature sensor */

/**
  * @}
  */

/** @defgroup ADC_LL_EC_REG_SEQ_RANKS  ADC - Sequencer ranks
  * @{
  */
#define LL_ADC_RANK_1  (ADC_SEQ_1_REGOFFSET | ADC_RANK_1_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  1 */
#define LL_ADC_RANK_2  (ADC_SEQ_1_REGOFFSET | ADC_RANK_2_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  2 */
#define LL_ADC_RANK_3  (ADC_SEQ_1_REGOFFSET | ADC_RANK_3_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  3 */
#define LL_ADC_RANK_4  (ADC_SEQ_1_REGOFFSET | ADC_RANK_4_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  4 */
#define LL_ADC_RANK_5  (ADC_SEQ_1_REGOFFSET | ADC_RANK_5_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  5 */
#define LL_ADC_RANK_6  (ADC_SEQ_1_REGOFFSET | ADC_RANK_6_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  6 */
#define LL_ADC_RANK_7  (ADC_SEQ_1_REGOFFSET | ADC_RANK_7_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  7 */
#define LL_ADC_RANK_8  (ADC_SEQ_1_REGOFFSET | ADC_RANK_8_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  8 */
#define LL_ADC_RANK_9  (ADC_SEQ_2_REGOFFSET | ADC_RANK_9_SEQ_X_BITOFFSET_POS)   /*!< ADC rank  9 */
#define LL_ADC_RANK_10 (ADC_SEQ_2_REGOFFSET | ADC_RANK_10_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 10 */
#define LL_ADC_RANK_11 (ADC_SEQ_2_REGOFFSET | ADC_RANK_11_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 11 */
#define LL_ADC_RANK_12 (ADC_SEQ_2_REGOFFSET | ADC_RANK_12_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 12 */
#define LL_ADC_RANK_13 (ADC_SEQ_2_REGOFFSET | ADC_RANK_13_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 13 */
#define LL_ADC_RANK_14 (ADC_SEQ_2_REGOFFSET | ADC_RANK_14_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 14 */
#define LL_ADC_RANK_15 (ADC_SEQ_2_REGOFFSET | ADC_RANK_15_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 15 */
#define LL_ADC_RANK_16 (ADC_SEQ_2_REGOFFSET | ADC_RANK_16_SEQ_X_BITOFFSET_POS)  /*!< ADC rank 16 */
/**
  * @}
  */

