stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
/** @defgroup ADC_LL_CALIB_POINT ADC calibration points definitions
  * @brief    It defines the parameters used for the functions
  *           @ref LL_ADC_SetCalibPointForDiff(), @ref LL_ADC_GetCalibPointForDiff(),
  *           @ref LL_ADC_SetCalibPointForSinglePos(), @ref LL_ADC_GetCalibPointForSinglePos(),
  *           @ref LL_ADC_SetCalibPointForSingleNeg(), @ref LL_ADC_GetCalibPointForSingleNeg(),
  * @{
  */

#define LL_ADC_CALIB_POINT_1  (0x00UL)  /*!< ADC calibration point 1 */
#define LL_ADC_CALIB_POINT_2  (0x01UL)  /*!< ADC calibration point 2 */
#define LL_ADC_CALIB_POINT_3  (0x02UL)  /*!< ADC calibration point 3 */
#define LL_ADC_CALIB_POINT_4  (0x03UL)  /*!< ADC calibration point 4 */

/**
  * @}
  */

/** @defgroup ADC_LL_AWD_CHANNEL ADC watchdog channel selection for bit mask definitions
  * @brief    It defines the parameters used for the functions @ref LL_ADC_SetAWDInputChannels()
  *           and @ref LL_ADC_GetAWDInputChannels()
  * @{
  */

#define LL_ADC_AWD_CH_VINM0      (ADC_WD_CONF_AWD_CHX_0 ) /*!< ADC watchdog channel selection: VINM0 to negative input  */
#define LL_ADC_AWD_CH_VINM1      (ADC_WD_CONF_AWD_CHX_1 ) /*!< ADC watchdog channel selection: VINM1 to negative input  */
#define LL_ADC_AWD_CH_VINM2      (ADC_WD_CONF_AWD_CHX_2 ) /*!< ADC watchdog channel selection: VINM2 to negative input  */
#define LL_ADC_AWD_CH_VINM3      (ADC_WD_CONF_AWD_CHX_3 ) /*!< ADC watchdog channel selection: VINM3 to negative input  */
#define LL_ADC_AWD_CH_VINP0      (ADC_WD_CONF_AWD_CHX_8 ) /*!< ADC watchdog channel selection: VINP0 to positive input  */
#define LL_ADC_AWD_CH_VINP1      (ADC_WD_CONF_AWD_CHX_9 ) /*!< ADC watchdog channel selection: VINP1 to positive input  */
#define LL_ADC_AWD_CH_VINP2      (ADC_WD_CONF_AWD_CHX_10) /*!< ADC watchdog channel selection: VINP2 to positive input  */
#define LL_ADC_AWD_CH_VINP3      (ADC_WD_CONF_AWD_CHX_11) /*!< ADC watchdog channel selection: VINP3 to positive input  */
#define LL_ADC_AWD_CH_MICROM     (ADC_WD_CONF_AWD_CHX_4 ) /*!< ADC watchdog channel selection: MICROM to negative input */
#define LL_ADC_AWD_CH_MICROP     (ADC_WD_CONF_AWD_CHX_12) /*!< ADC watchdog channel selection: MICROP to positive input */
#define LL_ADC_AWD_CH_VBAT       (ADC_WD_CONF_AWD_CHX_5 ) /*!< ADC watchdog channel selection: VBAT to negative input   */
#define LL_ADC_AWD_CH_TEMPSENSOR (ADC_WD_CONF_AWD_CHX_13) /*!< ADC watchdog channel selection: TEMP to positive input   */
#define LL_ADC_AWD_CH_VDDA_NEG   (ADC_WD_CONF_AWD_CHX_7 ) /*!< ADC watchdog channel selection: VDDA to negative input   */
#define LL_ADC_AWD_CH_VDDA_POS   (ADC_WD_CONF_AWD_CHX_15) /*!< ADC watchdog channel selection: VDDA to positive input   */
#define LL_ADC_AWD_CH_GND_NEG    (ADC_WD_CONF_AWD_CHX_6 ) /*!< ADC watchdog channel selection: GND to negative input    */
#define LL_ADC_AWD_CH_GND_POS    (ADC_WD_CONF_AWD_CHX_14) /*!< ADC watchdog channel selection: GND to positive input    */

/**
  * @}
  */


/** @defgroup ADC_LL_IRQ_STATUS_MASK ADC IRQ_STATUS register mask definitions
  * @brief    It defines the IRQ flags used for the functions @ref LL_ADC_ClearActiveFlags()
  *           and @ref LL_ADC_GetActiveFlags().
  * @{
  */
#define LL_ADC_IRQ_FLAG_OVRDS   (ADC_IRQ_STATUS_OVR_DS_IRQ)   /*!< ADC IRQ flag OVRDS */
#define LL_ADC_IRQ_FLAG_AWD1    (ADC_IRQ_STATUS_AWD_IRQ)      /*!< ADC IRQ flag AWD1  */
#define LL_ADC_IRQ_FLAG_EOC     (ADC_IRQ_STATUS_EOC_IRQ)      /*!< ADC IRQ flag EOC   */
#define LL_ADC_IRQ_FLAG_EOS     (ADC_IRQ_STATUS_EOS_IRQ)      /*!< ADC IRQ flag EOS   */
#define LL_ADC_IRQ_FLAG_EODS    (ADC_IRQ_STATUS_EODS_IRQ)     /*!< ADC IRQ flag EODS  */

#define LL_ADC_IRQ_FLAGS_MASK   (LL_ADC_IRQ_FLAG_OVRDS | \
                                 LL_ADC_IRQ_FLAG_AWD1  | \
                                 LL_ADC_IRQ_FLAG_EOC   | \
                                 LL_ADC_IRQ_FLAG_EOS   | \
                                 LL_ADC_IRQ_FLAG_EODS)

/**
  * @}
  */


/** @defgroup ADC_LL_IRQ_ENABLE ADC interrupts enable definitions
  * @brief    It defines the IRQ interrupt enable used for the functions @ref LL_ADC_ClearActiveFlags()
  *           and @ref LL_ADC_GetActiveFlags().
  * @{
  */

#define LL_ADC_IRQ_EN_OVRDS   (ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA)   /*!< ADC IRQ enable OVRDS */
#define LL_ADC_IRQ_EN_AWD1    (ADC_IRQ_ENABLE_AWD_IRQ_ENA)      /*!< ADC IRQ enable AWD1  */
#define LL_ADC_IRQ_EN_EOC     (ADC_IRQ_ENABLE_EOC_IRQ_ENA)      /*!< ADC IRQ enable EOC   */
#define LL_ADC_IRQ_EN_EOS     (ADC_IRQ_ENABLE_EOS_IRQ_ENA)      /*!< ADC IRQ enable EOS   */
#define LL_ADC_IRQ_EN_EODS    (ADC_IRQ_ENABLE_EODS_IRQ_ENA)     /*!< ADC IRQ enable EODS  */

/**
  * @}
  */

/**
  * @}
  */


/* Exported macro ------------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Macros ADC Exported Macros
  * @{
  */

/** @defgroup ADC_LL_EM_WRITE_READ Common write and read registers Macros
  * @{
  */

/**
  * @brief  Driver macro reserved for internal use: set a pointer to
  *         a register from a register basis from which an offset
  *         is applied.
  * @param  __REG__ Register basis from which the offset is applied.
  * @param  __REG_OFFFSET__ Offset to be applied (unit: number of registers).
  * @retval Pointer to register address
  */
#define __ADC_PTR_REG_OFFSET(__REG__, __REG_OFFFSET__)                         \
  ((__IO uint32_t *)((uint32_t) ((uint32_t)(&(__REG__)) + ((__REG_OFFFSET__) << 2UL))))

/**
  * @}
  */

/** @defgroup ADC_LL_EM_HELPER_MACRO ADC helper macro
  * @{
  */

#define LL_ADC_TEMPERATURE_CALC_ERROR      ((int16_t)0x7FFF)  /* Temperature calculation error using helper macro
                                                                 @ref __LL_ADC_CALC_TEMPERATURE(), due to issue on
                                                                 calibration parameters. This value is coded on 16 bits
                                                                 (to fit on signed word or double word) and corresponds
                                                                 to an inconsistent temperature value. */
/**
  * @brief  Helper macro to define the ADC conversion data full-scale digital
  *         value corresponding to the selected ADC resolution.
  * @note   ADC conversion data full-scale corresponds to voltage range
  *         determined by analog voltage references Vref+ and Vref-
  *         (refer to reference manual).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @retval ADC conversion data full-scale digital value (unit: digital value of ADC conversion data)
  */
#define __LL_ADC_DIGITAL_SCALE(__ADC_WIDTH__) (0xFFFFUL >> ((LL_ADC_DS_DATA_WIDTH_16_BIT) - (__ADC_WIDTH__)))

/**
  * @brief  Helper macro to define the ADC conversion data full-scale analog
  *         voltage value corresponding to the selected ADC input range.
  * @param  __INPUT_VOLTAGE_RANGE__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  * @retval ADC conversion data full-scale digital value (unit: digital value of ADC conversion data)
  */
#define __LL_ADC_REFERENCE_VOLTAGE(__INPUT_VOLTAGE_RANGE__) \
  (((__INPUT_VOLTAGE_RANGE__) == LL_ADC_VIN_RANGE_1V2) ? 1250UL : ((__INPUT_VOLTAGE_RANGE__) * 1200UL))

/**
  * @brief  Helper macro to determine whether the selected channel
  *         corresponds to literal definitions of driver.
  * @param  __CHANNEL__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CHANNEL_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINM3
  *         @arg @ref LL_ADC_CHANNEL_VINP0
  *         @arg @ref LL_ADC_CHANNEL_VINP1
  *         @arg @ref LL_ADC_CHANNEL_VINP2
  *         @arg @ref LL_ADC_CHANNEL_VINP3
  *         @arg @ref LL_ADC_CHANNEL_VINP0_VINM0
  *         @arg @ref LL_ADC_CHANNEL_VINP1_VINM1
  *         @arg @ref LL_ADC_CHANNEL_VINP2_VINM2
  *         @arg @ref LL_ADC_CHANNEL_VINP3_VINM3
  *         @arg @ref LL_ADC_CHANNEL_VBAT
  *         @arg @ref LL_ADC_CHANNEL_TEMPSENSOR
  * @retval Value "0" if the channel corresponds to a parameter definition of a ADC external channel
  *         (channel connected to a GPIO pin).
  *         Value "1" if the channel corresponds to a parameter definition of a ADC internal channel.
  */
#define __LL_ADC_IS_CHANNEL_INTERNAL(__CHANNEL__) ((__CHANNEL__) == (LL_ADC_CHANNEL_VBAT)          \
                                                   || (__CHANNEL__) == (LL_ADC_CHANNEL_TEMPSENSOR) \
                                                  )

/**
  * @brief  Helper macro to convert the ADC conversion data from
  *         a resolution to another resolution.
  * @param  __DATA__ ADC conversion data to be converted
  * @param  __ADC_WIDTH_CURRENT__ Resolution of the data to be converted
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @param  __ADC_WIDTH_TARGET__ Resolution of the data after conversion
  *         This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @retval ADC conversion data to the requested resolution
  */
#define __LL_ADC_CONVERT_DATA_RESOLUTION(__DATA__,\
                                         __ADC_WIDTH_CURRENT__,\
                                         __ADC_WIDTH_TARGET__)                \
(((__DATA__)                                                                  \
  << ((LL_ADC_DS_DATA_WIDTH_16_BIT) - (__ADC_WIDTH_CURRENT__)))               \
 >> ((LL_ADC_DS_DATA_WIDTH_16_BIT) - (__ADC_WIDTH_TARGET__))                  \
)

/**
  * @brief  Helper macro to calculate the voltage (unit: mVolt)
  *         corresponding to a ADC conversion data (unit: digital value).
  * @param  __INPUT_VOLTAGE_RANGE__ Analog reference voltage (unit: mV)
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  * @param  __ADC_DATA__ ADC conversion data (unit: digital value).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @retval ADC conversion data equivalent voltage value (unit: mVolt)
  */
#define __LL_ADC_CALC_DATA_TO_VOLTAGE(__INPUT_VOLTAGE_RANGE__,\
                                      __ADC_DATA__,\
                                      __ADC_WIDTH__)                            \
((__ADC_DATA__) * (int32_t)(__LL_ADC_REFERENCE_VOLTAGE(__INPUT_VOLTAGE_RANGE__))\
 / (int32_t)(__LL_ADC_DIGITAL_SCALE(__ADC_WIDTH__))                             \
)

/**
  * @brief  Helper macro to calculate the voltage (unit: mVolt)
  *         corresponding to a ADC conversion data (unit: digital value) in
  *         differential ended mode.
  * @note   ADC data from ADC data register is unsigned and centered around
  *         middle code in. Converted voltage can be positive or negative
  *         depending on differential input voltages.
  * @param  __INPUT_VOLTAGE_RANGE__ Analog reference voltage (unit: mV)
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  * @param  __ADC_DATA__ ADC conversion data (unit: digital value).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @retval ADC conversion data equivalent voltage value (unit: mVolt)
  */
#define __LL_ADC_CALC_DIFF_DATA_TO_VOLTAGE(__INPUT_VOLTAGE_RANGE__,\
                                           __ADC_DATA__,\
                                           __ADC_WIDTH__)                                   \
((int32_t)((__ADC_DATA__)) * (int32_t)(__LL_ADC_REFERENCE_VOLTAGE(__INPUT_VOLTAGE_RANGE__)) \
 / (int32_t)(__LL_ADC_DIGITAL_SCALE(__ADC_WIDTH__))                                         \
 - (int32_t)(__LL_ADC_REFERENCE_VOLTAGE(__INPUT_VOLTAGE_RANGE__) / 2 )                      \
)


/**
  * @brief  Helper macro to calculate the temperature (unit: degree Celsius)
  *         from ADC conversion data of internal temperature sensor.
  * @note   Computation is using temperature sensor calibration values
  *         stored in system memory for each device during production.
  * @note   Calculation formula:
  *           Temperature = (55 / (C85 - C30)) * (TS_ADC_DATA - C30) + 30
  *           with TS_ADC_DATA = temperature sensor raw data measured by ADC
  *                C85    = equivalent TS_ADC_DATA at temperature
  *                            TEMP_DEGC_CAL1 (calibrated in factory)
  *                C30    = equivalent TS_ADC_DATA at temperature
  *                            TEMP_DEGC_CAL2 (calibrated in factory)
  *         Caution: Calculation relevancy under reserve that calibration
  *                  parameters are correct (address and data).
  *                  To calculate temperature using temperature sensor
  *                  datasheet typical values (generic values less, therefore
  *                  less accurate than calibrated values),
  *                  use helper macro @ref __LL_ADC_CALC_TEMPERATURE_TYP_PARAMS().
  * @param  __TEMPSENSOR_ADC_DATA__ ADC conversion data of internal
  *                                 temperature sensor (unit: digital value).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @retval Temperature (unit: degree Celsius)
  *         In case or error, value LL_ADC_TEMPERATURE_CALC_ERROR is returned (inconsistent temperature value)
  */
#define __LL_ADC_CALC_TEMPERATURE(__TEMPSENSOR_ADC_DATA__, __ADC_WIDTH__)                                              \
  ( ((__ADC_WIDTH__) == LL_ADC_DS_DATA_WIDTH_12_BIT) ?                                                                 \
    (((__TEMPSENSOR_ADC_DATA__) - (int32_t)*TEMPSENSOR_C30_ADDR + (int32_t)*TEMPSENSOR_TCK_ADDR) / (10L))              \
    :                                                                                                                  \
    (__LL_ADC_CONVERT_DATA_RESOLUTION(                                                                                 \
        ((int32_t) __LL_ADC_CONVERT_DATA_RESOLUTION((__TEMPSENSOR_ADC_DATA__),                                         \
                                                    (__ADC_WIDTH__),                                                   \
                                                    LL_ADC_DS_DATA_WIDTH_16_BIT)                                       \
         - (int32_t) __LL_ADC_CONVERT_DATA_RESOLUTION(((int32_t)*TEMPSENSOR_C30_ADDR),                                 \
                                                      (LL_ADC_DS_DATA_WIDTH_12_BIT),                                   \
                                                      LL_ADC_DS_DATA_WIDTH_16_BIT)                                     \
         + (int32_t) __LL_ADC_CONVERT_DATA_RESOLUTION(((int32_t)*TEMPSENSOR_TCK_ADDR),                                 \
                                                      (LL_ADC_DS_DATA_WIDTH_12_BIT),                                   \
                                                      LL_ADC_DS_DATA_WIDTH_16_BIT)),                                   \
        LL_ADC_DS_DATA_WIDTH_16_BIT,                                                                                   \
        LL_ADC_DS_DATA_WIDTH_12_BIT) / 10L)                                                                            \
  )

/**
  * @brief  Helper macro to calculate the temperature (unit: degree Celsius)
  *         from ADC conversion data of internal temperature sensor.
  * @note   Computation is using temperature sensor typical values
  *         (refer to device datasheet).
  * @note   Calculation formula:
  *           Temperature = (Avg_Slope * (TS_ADC_DATA - VMIN) + TEMP_MIN
  *
  *           with TS_ADC_DATA = temperature sensor raw data measured by ADC
  *                Avg_Slope = (TEMP_MAX - TEMP_MIN) / (VMAX - VMIN))
  *                TEMP_MIN  = maximal temperature range of the sensor (unit: degC)
  *                TEMP_MAX  = maximal temperature range of the sensor (unit: degC)
  *                VMIN      = temperature sensor digital value at TEMP_MIN (unit: mV)
  *                VMAX      = temperature sensor digital value at TEMP_MAX (unit: mV)
  *         Caution: Calculation relevancy under reserve the temperature sensor
  *                  of the current device has characteristics in line with
  *                  datasheet typical values.
  *                  If temperature sensor calibration values are available on
  *                  on this device (presence of macro __LL_ADC_CALC_TEMPERATURE()),
  *                  temperature calculation will be more accurate using
  *                  helper macro @ref __LL_ADC_CALC_TEMPERATURE().
  * @param  __TEMPSENSOR_ADC_DATA__       ADC conversion data of internal temperature sensor (unit: digital value).
  * @param  __ADC_WIDTH__ This parameter can be one of the following values:
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_12_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_13_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_14_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_15_BIT
  *         @arg @ref LL_ADC_DS_DATA_WIDTH_16_BIT
  * @retval Temperature (unit: degree Celsius)
  */
#define __LL_ADC_CALC_TEMPERATURE_TYP_PARAMS(__TEMPSENSOR_ADC_DATA__,\
                                             __ADC_WIDTH__)                                                            \
(((__LL_ADC_CONVERT_DATA_RESOLUTION((__TEMPSENSOR_ADC_DATA__),(__ADC_WIDTH__), LL_ADC_DS_DATA_WIDTH_12_BIT)            \
   - 2500 + 300)                                                                                                       \
  / (10UL))                                                                                                            \
)

/**
  * @brief   Helper macro to convert the threshold value from mV to code for
  *          single conversion or battery sensor.
  * @param  __VOLTAGE_MV__ The voltage threshold for the ADC watchdog in mV.
  * @param  __INPUT_VOLTAGE_RANGE__ Analog reference voltage (unit: mV)
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  * @retval Returned 12-bit value to be used as ADC watchdog threshold.
  */
#define LL_ADC_CONVERT_VOLTAGE_TO_DATA_AWD_THRESHOLD_SINGLE(__VOLTAGE_MV__,\
                                                            __INPUT_VOLTAGE_RANGE__)                                   \
((uint32_t)(((__VOLTAGE_MV__) * __LL_ADC_DIGITAL_SCALE(ADC_DS_DATA_WIDTH_12_BIT))                                      \
            / (__LL_ADC_REFERENCE_VOLTAGE(__INPUT_VOLTAGE_RANGE__))))

/**
  * @brief  Helper macro to convert the threshold value from mV to code for
  *         differential conversion.
  * @param  __VOLTAGE_MV__ The voltage threshold for the ADC watchdog in mV.
  * @param  __INPUT_VOLTAGE_RANGE__ Analog reference voltage (unit: mV)
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  * @retval Returned 12-bit value to be used as ADC watchdog threshold.
  */
#define LL_ADC_CONVERT_VOLTAGE_TO_DATA_AWD_THRESHOLD_DIFF(__VOLTAGE_MV__,\
                                                          __INPUT_VOLTAGE_RANGE__)                                     \
((uint32_t)((((__VOLTAGE_MV__) * __LL_ADC_DIGITAL_SCALE(ADC_DS_DATA_WIDTH_12_BIT))                                    \
             / (2UL * __LL_ADC_REFERENCE_VOLTAGE(__INPUT_VOLTAGE_RANGE__)))                                            \
            + (__LL_ADC_DIGITAL_SCALE(ADC_DS_DATA_WIDTH_12_BIT) / 2UL)))

/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Functions ADC Exported Functions
  * @{
  */

/** @defgroup ADC_LL_EF_Configuration_ADC ADC Configuration functions
  * @{
  */

/**
  * @brief  Select the input sampling method.
  *         Sampling only at conversion start (default).
  *         Sampling starts at the end of conversion.
  * @rmtoll CONF     ADC_CONT_1V2       LL_ADC_SetInputSamplingMode
  * @param  ADCx ADC instance
  * @param  SamplingMode This parameter can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLING_AT_START
  *         @arg @ref LL_ADC_SAMPLING_AT_END
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetInputSamplingMode(ADC_TypeDef *ADCx, uint32_t SamplingMode)
{
  MODIFY_REG(ADCx->CONF, ADC_CONF_ADC_CONT_1V2, SamplingMode);
}

/**
  * @brief  Get input sampling mode.
  * @rmtoll CONF     ADC_CONT_1V2       LL_ADC_GetInputSamplingMode
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLING_AT_START
  *         @arg @ref LL_ADC_SAMPLING_AT_END
  */
__STATIC_INLINE uint32_t LL_ADC_GetInputSamplingMode(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_ADC_CONT_1V2));
}

/**
  * @brief  Enable the inversion of the ADC data output bits (1's complement)
  *         when a differential input is connected to the ADC
  * @rmtoll CONF     BIT_INVERT_DIFF     LL_ADC_InvertOutputDiffModeEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_InvertOutputDiffModeEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_BIT_INVERT_DIFF);
}

/**
  * @brief  Disable the inversion of the ADC data output bits (1's complement)
  *         when a differential input is connected to the ADC
  * @rmtoll CONF     BIT_INVERT_DIFF     LL_ADC_InvertOutputDiffModeDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_InvertOutputDiffModeDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_BIT_INVERT_DIFF);
}

/**
  * @brief  Check if the inversion of the ADC data output bits (1's complement)
  *         when a differential input is connected to the ADC is enabled.
  * @rmtoll CONF     BIT_INVERT_DIFF     LL_ADC_IsInvertOutputDiffModeEnabled
  * @param  ADCx ADC instance
  * @retval 0: inversion is not enabled, 1: inversion is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsInvertOutputDiffModeEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_BIT_INVERT_DIFF) == (ADC_CONF_BIT_INVERT_DIFF)) ? 1UL : 0UL);
}

