stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
/**
  * @brief  Enable the inversion of the ADC data output bits (1's complement)
  *         when a single negative input is connected to the ADC
  * @rmtoll CONF     BIT_INVERT_SN     LL_ADC_InvertOutputSingleNegModeEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_InvertOutputSingleNegModeEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_BIT_INVERT_SN);
}

/**
  * @brief  Disable the inversion of the ADC data output bits (1's complement)
  *         when a single negative input is connected to the ADC
  * @rmtoll CONF     BIT_INVERT_SN     LL_ADC_InvertOutputSingleNegModeDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_InvertOutputSingleNegModeDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_BIT_INVERT_SN);
}

/**
  * @brief  Check if the inversion of the ADC data output bits (1's complement)
  *         when a single negative input is connected to the ADC is enabled.
  * @rmtoll CONF     BIT_INVERT_SN     LL_ADC_IsInvertOutputSingleNegModeEnabled
  * @param  ADCx ADC instance
  * @retval 0: inversion is not enabled, 1: inversion is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsInvertOutputSingleNegModeEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_BIT_INVERT_SN) == (ADC_CONF_BIT_INVERT_SN)) ? 1UL : 0UL);
}

/**
  * @brief  Select the overrun configuration for the output data of
  *         the Down Sampler (DS).
  *         Previous data is kept, the new one is lost.
  *         Previous data is lost, the new one is kept.
  * @rmtoll CONF     OVR_DS_CFG       LL_ADC_SetOverrunDS
  * @param  ADCx ADC instance
  * @param  Overrun This parameter can be one of the following values:
  *         @arg @ref LL_ADC_NEW_DATA_IS_LOST
  *         @arg @ref LL_ADC_NEW_DATA_IS_KEPT
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetOverrunDS(ADC_TypeDef *ADCx, uint32_t Overrun)
{
  MODIFY_REG(ADCx->CONF, ADC_CONF_OVR_DS_CFG, Overrun);
}

/**
  * @brief  Get the overrun configuration for the output data of
  *         the Down Sampler (DS).
  *         Previous data is kept, the new one is lost.
  *         Previous data is lost, the new one is kept.
  * @rmtoll CONF     OVR_DS_CFG       LL_ADC_GetOverrunDS
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_NEW_DATA_IS_LOST
  *         @arg @ref LL_ADC_NEW_DATA_IS_KEPT
  */
__STATIC_INLINE uint32_t LL_ADC_GetOverrunDS(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_OVR_DS_CFG));
}

/**
  * @brief  Enable the DMA mode for the Down Sampler (DS) data path.
  * @rmtoll CONF     DMA_DS_ENA     LL_ADC_DMAModeDSEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DMAModeDSEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_DMA_DS_ENA);
}


/**
  * @brief  Disable the DMA mode for the Down Sampler (DS) data path.
  * @rmtoll CONF     DMA_DS_ENA     LL_ADC_DMAModeDSDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DMAModeDSDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_DMA_DS_ENA);
}


/**
  * @brief  Check if the DMA mode for the Down Sampler (DS) data path is enabled.
  * @rmtoll CONF     DMA_DS_ENA     LL_ADC_IsDMAModeDSEnabled
  * @param  ADCx ADC instance
  * @retval 0: DMA mode is not enabled, 1: DMA mode is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsDMAModeDSEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_DMA_DS_ENA) == (ADC_CONF_DMA_DS_ENA)) ? 1UL : 0UL);
}

/**
  * @brief  Select the ADC conversion rate.
  * @rmtoll CONF     SAMPLE_RATE       LL_ADC_SetSampleRate
  * @param  ADCx ADC instance
  * @param  SampleRate This parameter can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLE_RATE_16
  *         @arg @ref LL_ADC_SAMPLE_RATE_20
  *         @arg @ref LL_ADC_SAMPLE_RATE_24
  *         @arg @ref LL_ADC_SAMPLE_RATE_28
  *         @arg @ref LL_ADC_SAMPLE_RATE_32  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_36  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_40  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_44  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_48  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_52  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_56  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_60  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_64  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_68  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_72  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_76  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_80  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_84  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_88  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_92  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_96  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_100 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_104 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_108 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_112 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_116 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_120 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_124 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_128 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_132 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_136 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_140 (1)
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetSampleRate(ADC_TypeDef *ADCx, uint32_t SampleRate)
{
  MODIFY_REG(ADCx->CONF, ADC_CONF_SAMPLE_RATE | ADC_CONF_SAMPLE_RATE_MSB, SampleRate);
}


/**
  * @brief  Get the ADC conversion rate.
  * @rmtoll CONF     SAMPLE_RATE       LL_ADC_GetSampleRate
  * @param  ADCx ADC instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_SAMPLE_RATE_16
  *         @arg @ref LL_ADC_SAMPLE_RATE_20
  *         @arg @ref LL_ADC_SAMPLE_RATE_24
  *         @arg @ref LL_ADC_SAMPLE_RATE_28
  *         @arg @ref LL_ADC_SAMPLE_RATE_32  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_36  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_40  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_44  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_48  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_52  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_56  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_60  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_64  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_68  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_72  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_76  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_80  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_84  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_88  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_92  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_96  (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_100 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_104 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_108 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_112 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_116 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_120 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_124 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_128 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_132 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_136 (1)
  *         @arg @ref LL_ADC_SAMPLE_RATE_140 (1)
  */
__STATIC_INLINE uint32_t LL_ADC_GetSampleRate(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_SAMPLE_RATE | ADC_CONF_SAMPLE_RATE_MSB));
}


/**
  * @brief  Enable the synchronization of the ADC start conversion with
  *         a pulse generated by the SMPS.
  * @note   This bitfield must be 0 when the ADC clock is 32 MHz or
  *         when the SMPS is not used.
  * @rmtoll CONF     SMPS_SYNCHRO_ENA     LL_ADC_SMPSSyncEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SMPSSyncEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_SMPS_SYNCHRO_ENA);
}

/**
  * @brief  Disable the synchronization of the ADC start conversion with
  *         a pulse generated by the SMPS.
  * @note   This bitfield must be 0 when the ADC clock is 32 MHz or
  *         when the SMPS is not used.
  * @rmtoll CONF     SMPS_SYNCHRO_ENA     LL_ADC_SMPSSyncDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SMPSSyncDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_SMPS_SYNCHRO_ENA);
}


/**
  * @brief  Check if the the synchronization of the ADC start conversion with
  *         a pulse generated by the SMPS is enabled.
  * @note   This bitfield must be 0 when the ADC clock is 32 MHz or
  *         when the SMPS is not used.
  * @rmtoll CONF     SMPS_SYNCHRO_ENA     LL_ADC_IsSMPSSyncEnabled
  * @param  ADCx ADC instance
  * @retval 0: Synchronization with SMPS is not enabled, 1: Synchronization with SMPS is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsSMPSSyncEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_SMPS_SYNCHRO_ENA) == (ADC_CONF_SMPS_SYNCHRO_ENA)) ? 1UL : 0UL);
}


/**
  * @brief  Set the number of conversion in a sequence starting from SEQ0.
  * @rmtoll CONF     SEQ_LEN       LL_ADC_SetSequenceLength
  * @param  ADCx ADC instance
  * @param  SequenceLength This parameter must be a number between Min_Data = 1 and Max_Data = 16.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetSequenceLength(ADC_TypeDef *ADCx, uint32_t SequenceLength)
{
  MODIFY_REG(ADCx->CONF, ADC_CONF_SEQ_LEN, (SequenceLength - 1UL) << ADC_CONF_SEQ_LEN_Pos);
}


/**
  * @brief  Get the number of conversion in a sequence starting from SEQ0.
  * @rmtoll CONF     SEQ_LEN       LL_ADC_GetSequenceLength
  * @param  ADCx ADC instance
  * @retval Returned value is a number between Min_Data = 1 and Max_Data = 16.
  */
__STATIC_INLINE uint32_t LL_ADC_GetSequenceLength(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->CONF, ADC_CONF_SEQ_LEN) >> ADC_CONF_SEQ_LEN_Pos) + 1UL;
}


/**
  * @brief  Enable the ADC conversion in sequence mode.
  * @rmtoll CONF     SEQUENCE     LL_ADC_SequenceModeEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SequenceModeEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_SEQUENCE);
}


/**
  * @brief  Disable the ADC conversion in sequence mode.
  * @rmtoll CONF     SEQUENCE     LL_ADC_SequenceModeDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SequenceModeDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_SEQUENCE);
}


/**
  * @brief  Check if the ADC conversion in sequence mode is enabled.
  * @rmtoll CONF     SEQUENCE     LL_ADC_IsSequenceModeEnabled
  * @param  ADCx ADC instance
  * @retval 0: Sequence mode is not enabled, 1: Sequence mode is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsSequenceModeEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_SEQUENCE) == (ADC_CONF_SEQUENCE)) ? 1UL : 0UL);
}


/**
  * @brief  Enable the ADC continuous conversion mode.
  *         When a sequence is over, the conversion starts again.
  * @note   Stop the conversion can be made by sets the STOP_OP_MODE bit.
  *         Call the API @ref LL_ADC_StopConversion().
  * @rmtoll CONF     CONT     LL_ADC_ContinuousModeEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ContinuousModeEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CONF, ADC_CONF_CONT);
}


/**
  * @brief  Disable the ADC continuous conversion mode.
  *         When a sequence is over, the conversion stops (single conversion mode).
  * @rmtoll CONF     CONT     LL_ADC_ContinuousModeDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ContinuousModeDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CONF, ADC_CONF_CONT);
}


/**
  * @brief  Check if the ADC continuous conversion mode is enabled.
  * @rmtoll CONF     CONT     LL_ADC_IsContinuousModeEnabled
  * @param  ADCx ADC instance
  * @retval 0: Continuous mode is not enabled, 1: Continuous mode is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsContinuousModeEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CONF, ADC_CONF_CONT) == (ADC_CONF_CONT)) ? 1UL : 0UL);
}

/**
  * @}
  */


/** @defgroup ADC_LL_EF_Control_ADC ADC Control functions
  * @{
  */

/**
  * @brief  Stop the ongoing ADC conversion.
  * @note   This bit is set by software and cleared by hardware.
  * @note   When the STOP_MODE_OP is set, the user has to wait around 10 us before
  *         to start a new ADC conversion (set START_CONV bit).
  * @rmtoll CTRL     STOP_OP_MODE     LL_ADC_StopConversion
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_StopConversion(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL, ADC_CTRL_STOP_OP_MODE);
}


/**
  * @brief  Check if the stop conversion is ongoing.
  * @rmtoll CTRL     STOP_OP_MODE     LL_ADC_IsStopConversionOngoing
  * @param  ADCx ADC instance
  * @retval 0: stop conversion is not ongoing, 1: stop conversion is ongoing.
  */
__STATIC_INLINE uint32_t LL_ADC_IsStopConversionOngoing(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CTRL, ADC_CTRL_STOP_OP_MODE) == (ADC_CTRL_STOP_OP_MODE)) ? 1UL : 0UL);
}


/**
  * @brief  Start an ADC conversion.
  * @note   This bit is set by software and cleared by hardware.
  * @rmtoll CTRL     START_CONV     LL_ADC_StartConversion
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_StartConversion(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL, ADC_CTRL_START_CONV);
}


/**
  * @brief  Check if the ADC conversion is ongoing.
  * @rmtoll CTRL     ADC_ON_OFF     LL_ADC_IsConversionOngoing
  * @param  ADCx ADC instance
  * @retval 0: ADC conversion is not ongoing, 1: ADC conversion is ongoing.
  */
__STATIC_INLINE uint32_t LL_ADC_IsConversionOngoing(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CTRL, ADC_CTRL_ADC_ON_OFF) == (ADC_CTRL_ADC_ON_OFF)) ? 1UL : 0UL);
}


/**
  * @brief  Power on the ADC.
  * @rmtoll CTRL     ADC_ON_OFF     LL_ADC_Enable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_Enable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->CTRL, ADC_CTRL_ADC_ON_OFF);
}


/**
  * @brief  Power off the ADC.
  * @rmtoll CTRL     ADC_ON_OFF     LL_ADC_Disable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_Disable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->CTRL, ADC_CTRL_ADC_ON_OFF);
}


/**
  * @brief  Check if the ADC is on.
  * @rmtoll CTRL     ADC_ON_OFF     LL_ADC_IsEnabled
  * @param  ADCx ADC instance
  * @retval 0: ADC is off, 1: ADC is on.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabled(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->CTRL, ADC_CTRL_ADC_ON_OFF) == (ADC_CTRL_ADC_ON_OFF)) ? 1UL : 0UL);
}


/**
  * @}
  */


