stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
  return (uint32_t)(READ_BIT(*preg, ADC_COMP_1_GAIN1));
}


/**
  * @brief  Set the offset of the calibration point 1.
  * @rmtoll COMP_1     OFFSET1       LL_ADC_SetCalibPointOffset
  * @param  ADCx ADC instance
  * @param  Offset the signed offset of the first calibration point.
  * @param  Point This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetCalibPointOffset(ADC_TypeDef *ADCx, uint32_t Point, uint8_t Offset)
{
  __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->COMP_1, Point);

  MODIFY_REG(*preg, ADC_COMP_1_OFFSET1, (Offset << ADC_COMP_1_OFFSET1_Pos));
}


/**
  * @brief  Get the offset of the calibration point 1.
  * @rmtoll COMP_1     OFFSET1       LL_ADC_GetCalibPointOffset
  * @param  ADCx ADC instance
  * @param  Point This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  * @retval Return the signed offset of the first calibration point.
  */
__STATIC_INLINE uint32_t LL_ADC_GetCalibPointOffset(const ADC_TypeDef *ADCx, uint32_t Point)
{
  const __IO uint32_t *preg = __ADC_PTR_REG_OFFSET(ADCx->COMP_1, Point);

  return (uint32_t)(READ_BIT(*preg, ADC_COMP_1_OFFSET1) >> ADC_COMP_1_OFFSET1_Pos);
}

/**
  * @brief  Set the use of a specific calibration point for ADC differential mode
  * @rmtoll COMP_SEL     ADC_COMP_SEL_OFFSET_GAIN8       LL_ADC_SetCalibPointForDiff
  * @param  ADCx ADC instance
  * @param  Point This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  * @param  Range This parameter can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetCalibPointForDiff(ADC_TypeDef *ADCx, uint32_t Point, uint32_t Range)
{
  if (Range == LL_ADC_VIN_RANGE_1V2)
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN2 << ADC_COMP_SEL_OFFSET_GAIN0_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN2_Pos + ADC_COMP_SEL_OFFSET_GAIN0_Pos)));
  }
  else if (Range == LL_ADC_VIN_RANGE_2V4)
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN2 << ADC_COMP_SEL_OFFSET_GAIN3_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN2_Pos + ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
  else
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN2 << ADC_COMP_SEL_OFFSET_GAIN6_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN2_Pos + ADC_COMP_SEL_OFFSET_GAIN6_Pos)));
  }
}


/**
  * @brief  Get what calibration point is used for ADC differential mode.
  * @rmtoll COMP_SEL     ADC_COMP_SEL_OFFSET_GAIN8       LL_ADC_GetCalibPointForDiff
  * @param  ADCx ADC instance
  * @param  Range This parameter can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  */
__STATIC_INLINE uint32_t LL_ADC_GetCalibPointForDiff(const ADC_TypeDef *ADCx, uint32_t Range)
{
  if (Range == LL_ADC_VIN_RANGE_1V2)
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN2)
                       >> ADC_COMP_SEL_OFFSET_GAIN2_Pos));
  }
  else if (Range == LL_ADC_VIN_RANGE_2V4)
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN2 << ADC_COMP_SEL_OFFSET_GAIN3_Pos)
                       >> (ADC_COMP_SEL_OFFSET_GAIN2_Pos + ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
  else
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN2 << ADC_COMP_SEL_OFFSET_GAIN6_Pos)
                       >> (ADC_COMP_SEL_OFFSET_GAIN2_Pos + ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
}

/**
  * @brief  Set the use of a specific calibration point for
  *         ADC single positive mode
  * @rmtoll COMP_SEL     ADC_COMP_SEL_OFFSET_GAIN7       LL_ADC_SetCalibPointForSinglePos
  * @param  ADCx ADC instance
  * @param  Point This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  * @param  Range This parameter can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetCalibPointForSinglePos(ADC_TypeDef *ADCx, uint32_t Point, uint32_t Range)
{
  if (Range == LL_ADC_VIN_RANGE_1V2)
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN1 << ADC_COMP_SEL_OFFSET_GAIN0_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN1_Pos + ADC_COMP_SEL_OFFSET_GAIN0_Pos)));
  }
  else if (Range == LL_ADC_VIN_RANGE_2V4)
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN1 << ADC_COMP_SEL_OFFSET_GAIN3_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN1_Pos + ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
  else
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN1 << ADC_COMP_SEL_OFFSET_GAIN6_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN1_Pos + ADC_COMP_SEL_OFFSET_GAIN6_Pos)));
  }
}


/**
  * @brief  Get what calibration point is used for
  *         ADC single positive mode
  * @rmtoll COMP_SEL     ADC_COMP_SEL_OFFSET_GAIN7       LL_ADC_GetCalibPointForSinglePos
  * @param  ADCx ADC instance
  * @param  Range This parameter can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  */
__STATIC_INLINE uint32_t LL_ADC_GetCalibPointForSinglePos(const ADC_TypeDef *ADCx, uint32_t Range)
{
  if (Range == LL_ADC_VIN_RANGE_1V2)
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN1) >> ADC_COMP_SEL_OFFSET_GAIN1_Pos));
  }
  else if (Range == LL_ADC_VIN_RANGE_2V4)
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN1 << ADC_COMP_SEL_OFFSET_GAIN3_Pos)
                       >> (ADC_COMP_SEL_OFFSET_GAIN1_Pos + ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
  else
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN1 << ADC_COMP_SEL_OFFSET_GAIN6_Pos)
                       >> (ADC_COMP_SEL_OFFSET_GAIN1_Pos + ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
}

/**
  * @brief  Set the use of a specific calibration point for
  *         ADC single negative mode
  *         and battery level detector.
  * @rmtoll COMP_SEL     ADC_COMP_SEL_OFFSET_GAIN6       LL_ADC_SetCalibPointForSingleNeg
  * @param  ADCx ADC instance
  * @param  Point This parameter can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  * @param  Range This parameter can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetCalibPointForSingleNeg(ADC_TypeDef *ADCx, uint32_t Point, uint32_t Range)
{
  if (Range == LL_ADC_VIN_RANGE_1V2)
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN0 << ADC_COMP_SEL_OFFSET_GAIN0_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN0_Pos + ADC_COMP_SEL_OFFSET_GAIN0_Pos)));
  }
  else if (Range == LL_ADC_VIN_RANGE_2V4)
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN0 << ADC_COMP_SEL_OFFSET_GAIN3_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN0_Pos + ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
  else
  {
    MODIFY_REG(ADCx->COMP_SEL, (ADC_COMP_SEL_OFFSET_GAIN0 << ADC_COMP_SEL_OFFSET_GAIN6_Pos),
               (Point << (ADC_COMP_SEL_OFFSET_GAIN0_Pos + ADC_COMP_SEL_OFFSET_GAIN6_Pos)));
  }
}


/**
  * @brief  Get what calibration point is used for
  *         ADC single negative mode
  *         and battery level detector.
  * @rmtoll COMP_SEL     ADC_COMP_SEL_OFFSET_GAIN6       LL_ADC_GetCalibPointForSingleNeg
  * @param  ADCx ADC instance
  * @param  Range This parameter can be one of the following values:
  *         @arg @ref LL_ADC_VIN_RANGE_1V2
  *         @arg @ref LL_ADC_VIN_RANGE_2V4
  *         @arg @ref LL_ADC_VIN_RANGE_3V6
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_ADC_CALIB_POINT_1
  *         @arg @ref LL_ADC_CALIB_POINT_2
  *         @arg @ref LL_ADC_CALIB_POINT_3
  *         @arg @ref LL_ADC_CALIB_POINT_4
  */
__STATIC_INLINE uint32_t LL_ADC_GetCalibPointForSingleNeg(const ADC_TypeDef *ADCx, uint32_t Range)
{
  if (Range == LL_ADC_VIN_RANGE_1V2)
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN0) >> ADC_COMP_SEL_OFFSET_GAIN0_Pos));
  }
  else if (Range == LL_ADC_VIN_RANGE_2V4)
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN0 << ADC_COMP_SEL_OFFSET_GAIN3_Pos)
                       >> (ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
  else
  {
    return ((uint32_t)(READ_BIT(ADCx->COMP_SEL, ADC_COMP_SEL_OFFSET_GAIN0 << ADC_COMP_SEL_OFFSET_GAIN6_Pos)
                       >> (ADC_COMP_SEL_OFFSET_GAIN3_Pos)));
  }
}

/**
  * @}
  */


