stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
/** @defgroup ADC_LL_EF_AWD_TH_Configuration ADC Watchdog Thresholds Configuration functions
  * @{
  */

/**
  * @brief  Configure the WatchDoG threshold low and high.
  * @rmtoll WD_TH     ADC_WD_TH_WD_LT       LL_ADC_ConfigureAWDThresholds\n
  *         WD_TH     ADC_WD_TH_WD_HT       LL_ADC_ConfigureAWDThresholds
  * @param  ADCx ADC instance
  * @param  LowThreshold This parameter is a 12-bit value.
  * @param  HighThreshold This parameter is a 12-bit value.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ConfigureAWDThresholds(ADC_TypeDef *ADCx, uint32_t LowThreshold, uint32_t HighThreshold)
{
  MODIFY_REG(ADCx->WD_TH, (ADC_WD_TH_WD_LT | ADC_WD_TH_WD_HT), (LowThreshold | (HighThreshold << ADC_WD_TH_WD_HT_Pos)));
}


/**
  * @brief  Set the WatchDoG threshold low.
  * @rmtoll WD_TH     ADC_WD_TH_WD_LT     LL_ADC_SetAWDThresholdLow
  * @param  ADCx ADC instance
  * @param  Threshold This parameter is a 12-bit value.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAWDThresholdLow(ADC_TypeDef *ADCx, uint32_t Threshold)
{
  MODIFY_REG(ADCx->WD_TH, ADC_WD_TH_WD_LT, Threshold);
}


/**
  * @brief  Get the WatchDoG threshold low.
  * @rmtoll WD_TH     ADC_WD_TH_WD_LT     LL_ADC_GetAWDThresholdLow
  * @param  ADCx ADC instance
  * @retval Returned value of the low threshold.
  */
__STATIC_INLINE uint32_t LL_ADC_GetAWDThresholdLow(const ADC_TypeDef *ADCx)
{
  return ((uint32_t)(READ_BIT(ADCx->WD_TH, ADC_WD_TH_WD_LT)));
}

/**
  * @brief  Set the WatchDoG threshold high.
  * @rmtoll WD_TH     ADC_WD_TH_WD_HT     LL_ADC_SetAWDThresholdHigh
  * @param  ADCx ADC instance
  * @param  Threshold This parameter is a 12-bit value.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAWDThresholdHigh(ADC_TypeDef *ADCx, uint32_t Threshold)
{
  MODIFY_REG(ADCx->WD_TH, ADC_WD_TH_WD_HT, (Threshold << ADC_WD_TH_WD_HT_Pos));
}


/**
  * @brief  Get the WatchDoG threshold high.
  * @rmtoll WD_TH     ADC_WD_TH_WD_HT     LL_ADC_GetAWDThresholdHigh
  * @param  ADCx ADC instance
  * @retval Returned value of the high threshold.
  */
__STATIC_INLINE uint32_t LL_ADC_GetAWDThresholdHigh(const ADC_TypeDef *ADCx)
{
  return ((uint32_t)(READ_BIT(ADCx->WD_TH, ADC_WD_TH_WD_HT) >> ADC_WD_TH_WD_HT_Pos));
}


/**
  * @brief  Set the input channels the watchdog must check.
  * @note   ChannelMask can be an OR of the listed parameters.
  * @rmtoll WD_CONF     AWD_CHX       LL_ADC_SetAWDInputChannels
  * @param  ADCx ADC instance
  * @param  ChannelMask This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_AWD_CH_VINM0
  *         @arg @ref LL_ADC_AWD_CH_VINM1
  *         @arg @ref LL_ADC_AWD_CH_VINM2
  *         @arg @ref LL_ADC_AWD_CH_VINM3
  *         @arg @ref LL_ADC_AWD_CH_MICROM
  *         @arg @ref LL_ADC_AWD_CH_VBAT
  *         @arg @ref LL_ADC_AWD_CH_GND_NEG
  *         @arg @ref LL_ADC_AWD_CH_VDDA_NEG
  *         @arg @ref LL_ADC_AWD_CH_VINP0
  *         @arg @ref LL_ADC_AWD_CH_VINP1
  *         @arg @ref LL_ADC_AWD_CH_VINP2
  *         @arg @ref LL_ADC_AWD_CH_VINP3
  *         @arg @ref LL_ADC_AWD_CH_MICROP
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR
  *         @arg @ref LL_ADC_AWD_CH_GND_POS
  *         @arg @ref LL_ADC_AWD_CH_VDDA_POS
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetAWDInputChannels(ADC_TypeDef *ADCx, uint32_t ChannelMask)
{
  MODIFY_REG(ADCx->WD_CONF, ADC_WD_CONF_AWD_CHX, ChannelMask);
}


/**
  * @brief  Get the input channels the watchdog must check.
  * @note   The returned value can be an OR of the listed parameters.
  * @rmtoll WD_CONF     AWD_CHX       LL_ADC_GetAWDInputChannels
  * @param  ADCx ADC instance
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_ADC_AWD_CH_VINM0
  *         @arg @ref LL_ADC_AWD_CH_VINM1
  *         @arg @ref LL_ADC_AWD_CH_VINM2
  *         @arg @ref LL_ADC_AWD_CH_VINM3
  *         @arg @ref LL_ADC_AWD_CH_MICROM
  *         @arg @ref LL_ADC_AWD_CH_VBAT
  *         @arg @ref LL_ADC_AWD_CH_GND_NEG
  *         @arg @ref LL_ADC_AWD_CH_VDDA_NEG
  *         @arg @ref LL_ADC_AWD_CH_VINP0
  *         @arg @ref LL_ADC_AWD_CH_VINP1
  *         @arg @ref LL_ADC_AWD_CH_VINP2
  *         @arg @ref LL_ADC_AWD_CH_VINP3
  *         @arg @ref LL_ADC_AWD_CH_MICROP
  *         @arg @ref LL_ADC_AWD_CH_TEMPSENSOR
  *         @arg @ref LL_ADC_AWD_CH_GND_POS
  *         @arg @ref LL_ADC_AWD_CH_VDDA_POS
  */
__STATIC_INLINE uint32_t LL_ADC_GetAWDInputChannels(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->WD_CONF, ADC_WD_CONF_AWD_CHX));
}


/**
  * @}
  */


/** @defgroup ADC_LL_EF_Output_Data ADC Output Data functions
  * @{
  */


/**
  * @brief  Get the 16-bit output data from the Down Sampler (DS).
  * @rmtoll DS_DATAOUT       DS_DATA          LL_ADC_DSGetOutputData
  * @param  ADCx ADC instance
  * @retval The output data from DS.
  */
__STATIC_INLINE uint32_t LL_ADC_DSGetOutputData(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->DS_DATAOUT, ADC_DS_DATAOUT_DS_DATA));
}

/**
  * @}
  */


/** @defgroup ADC_LL_EF_FLAG_Management ADC flag management
  * @{
  */

/**
  * @brief  Get all the flags status.
  * @param  ADCx ADC instance
  * @retval All the status flags of the register IRQ_STATUS.
  *         The value is a combination of the following values:
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDS
  *         @arg @ref LL_ADC_IRQ_FLAG_AWD1
  *         @arg @ref LL_ADC_IRQ_FLAG_EOC
  *         @arg @ref LL_ADC_IRQ_FLAG_EOS
  *         @arg @ref LL_ADC_IRQ_FLAG_EODS
  */
__STATIC_INLINE uint32_t LL_ADC_GetActiveFlags(ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->IRQ_STATUS, LL_ADC_IRQ_FLAGS_MASK));
}

/**
  * @brief  Clear all the flags status.
  * @param  ADCx ADC instance
  * @param  FlagsMask This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDS
  *         @arg @ref LL_ADC_IRQ_FLAG_AWD1
  *         @arg @ref LL_ADC_IRQ_FLAG_EOC
  *         @arg @ref LL_ADC_IRQ_FLAG_EOS
  *         @arg @ref LL_ADC_IRQ_FLAG_EODS
  * @retval None.
  */
__STATIC_INLINE void LL_ADC_ClearActiveFlags(ADC_TypeDef *ADCx, uint32_t FlagsMask)
{
  WRITE_REG(ADCx->IRQ_STATUS, FlagsMask);
}

/**
  * @brief  Get if the flags status is set.
  * @param  ADCx ADC instance
  * @param  FlagsMask This parameter can be one of the following values:
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDS
  *         @arg @ref LL_ADC_IRQ_FLAG_AWD1
  *         @arg @ref LL_ADC_IRQ_FLAG_EOC
  *         @arg @ref LL_ADC_IRQ_FLAG_EOS
  *         @arg @ref LL_ADC_IRQ_FLAG_EODS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag(const ADC_TypeDef *ADCx, uint32_t FlagsMask)
{
  return ((READ_BIT(ADCx->IRQ_STATUS, FlagsMask) == (FlagsMask)) ? 1UL : 0UL);
}

/**
  * @brief  Get the status of the flag OVR_DS.
  *         The flag indicates, if set, the Down Sampler output is overran (at least one data is lost).
  * @rmtoll IRQ_STATUS      OVR_DS_IRQ     LL_ADC_IsActiveFlag_OVRDS
  * @param  ADCx ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_OVRDS(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_OVR_DS_IRQ) == (ADC_IRQ_STATUS_OVR_DS_IRQ)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flag OVR_DS.
  * @rmtoll IRQ_STATUS      OVR_DS_IRQ     LL_ADC_ClearFlag_OVRDS
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_OVRDS(ADC_TypeDef *ADCx)
{
  WRITE_REG(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_OVR_DS_IRQ);
}

/**
  * @brief  Get the status of the flag AWD.
  *         The flag indicates, if set, an event of the watchdog has occurred.
  * @rmtoll IRQ_STATUS      AWD_IRQ     LL_ADC_IsActiveFlag_AWD
  * @param  ADCx ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_AWD(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_AWD_IRQ) == (ADC_IRQ_STATUS_AWD_IRQ)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flag AWD.
  * @rmtoll IRQ_STATUS      AWD_IRQ     LL_ADC_ClearFlag_AWD
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_AWD(ADC_TypeDef *ADCx)
{
  WRITE_REG(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_AWD_IRQ);
}

/**
  * @brief  Get the status of the flag EOS.
  *         The flag indicates, if set, the End Of a Sequence of conversion.
  * @rmtoll IRQ_STATUS      EOS_IRQ     LL_ADC_IsActiveFlag_EOS
  * @param  ADCx ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_EOS(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_EOS_IRQ) == (ADC_IRQ_STATUS_EOS_IRQ)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flag EOS.
  * @rmtoll IRQ_STATUS      EOS_IRQ     LL_ADC_ClearFlag_EOS
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_EOS(ADC_TypeDef *ADCx)
{
  WRITE_REG(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_EOS_IRQ);
}

/**
  * @brief  Get the status of the flag EODS.
  *         The flag indicates, if set, the End Of a Down Sampler conversion.
  * @rmtoll IRQ_STATUS      EODS_IRQ     LL_ADC_IsActiveFlag_EODS
  * @param  ADCx ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_EODS(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_EODS_IRQ) == (ADC_IRQ_STATUS_EODS_IRQ)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flag EODS.
  * @rmtoll IRQ_STATUS      EODS_IRQ     LL_ADC_ClearFlag_EODS
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_EODS(ADC_TypeDef *ADCx)
{
  WRITE_REG(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_EODS_IRQ);
}

/**
  * @brief  Get the status of the flag EOC.
  *         The flag indicates, if set, the End Of Conversion.
  * @rmtoll IRQ_STATUS      EOC_IRQ     LL_ADC_IsActiveFlag_EOC
  * @param  ADCx ADC instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsActiveFlag_EOC(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_EOC_IRQ) == (ADC_IRQ_STATUS_EOC_IRQ)) ? 1UL : 0UL);
}


/**
  * @brief  Clear the flag EOC.
  * @rmtoll IRQ_STATUS      EOC_IRQ     LL_ADC_ClearFlag_EOC
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_ClearFlag_EOC(ADC_TypeDef *ADCx)
{
  WRITE_REG(ADCx->IRQ_STATUS, ADC_IRQ_STATUS_EOC_IRQ);
}

/**
  * @}
  */

