stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
/** @defgroup ADC_LL_EF_IT_Management ADC IT management
  * @{
  */

/**
  * @brief  Enable the interrupts according to the interrupt mask passed as parameter.
  * @param  ADCx ADC instance
  * @param  IrqMask This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_IRQ_EN_OVRDS
  *         @arg @ref LL_ADC_IRQ_EN_AWD1
  *         @arg @ref LL_ADC_IRQ_EN_EOS
  *         @arg @ref LL_ADC_IRQ_EN_EODS
  * @retval None.
  */
__STATIC_INLINE void LL_ADC_EnableIT(ADC_TypeDef *ADCx, uint32_t IrqMask)
{
  SET_BIT(ADCx->IRQ_ENABLE, IrqMask);
}


/**
  * @brief  Disable the interrupts according to the interrupt mask passed as parameter.
  * @param  ADCx ADC instance
  * @param  IrqMask This parameter can be a combination of the following values:
  *         @arg @ref LL_ADC_IRQ_EN_OVRDS
  *         @arg @ref LL_ADC_IRQ_EN_AWD1
  *         @arg @ref LL_ADC_IRQ_EN_EOS
  *         @arg @ref LL_ADC_IRQ_EN_EODS
  * @retval None.
  */
__STATIC_INLINE void LL_ADC_DisableIT(ADC_TypeDef *ADCx, uint32_t IrqMask)
{
  CLEAR_BIT(ADCx->IRQ_ENABLE, IrqMask);
}


/**
  * @brief  Get if the specific flag is enabled or not.
  * @param  ADCx ADC instance
  * @param  IrqMask This parameter can be one of the following values:
  *         @arg @ref LL_ADC_IRQ_FLAG_OVRDS
  *         @arg @ref LL_ADC_IRQ_FLAG_AWD1
  *         @arg @ref LL_ADC_IRQ_FLAG_EOC
  *         @arg @ref LL_ADC_IRQ_FLAG_EOS
  *         @arg @ref LL_ADC_IRQ_FLAG_EODS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT(const ADC_TypeDef *ADCx, uint32_t IrqMask)
{
  return ((READ_BIT(ADCx->IRQ_ENABLE, IrqMask) == (IrqMask)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Down Sampler overrun interrupt.
  * @rmtoll IRQ_ENABLE     OVR_DS_IRQ_ENA     LL_ADC_EnableIT_DSOVR
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_EnableIT_DSOVR(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA);
}


/**
  * @brief  Disable the Down Sampler overrun interrupt.
  * @rmtoll IRQ_ENABLE     OVR_DS_IRQ_ENA     LL_ADC_DisableIT_DSOVR
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DisableIT_DSOVR(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA);
}


/**
  * @brief  Check if the Down Sampler overrun interrupt is enabled.
  * @rmtoll IRQ_ENABLE     OVR_DS_IRQ_ENA     LL_ADC_IsEnabledIT_DSOVR
  * @param  ADCx ADC instance
  * @retval 0: The interrupt is not enabled, 1: The interrupt is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_DSOVR(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA) == (ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA)) ? 1UL : 0UL);
}


/**
  * @brief  Enable the watchdog event interrupt.
  * @rmtoll IRQ_ENABLE     AWD_IRQ_ENA     LL_ADC_EnableIT_AWD
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_EnableIT_AWD(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_AWD_IRQ_ENA);
}


/**
  * @brief  Disable the watchdog event interrupt.
  * @rmtoll IRQ_ENABLE     AWD_IRQ_ENA     LL_ADC_DisableIT_AWD
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DisableIT_AWD(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_AWD_IRQ_ENA);
}


/**
  * @brief  Check if the watchdog event interrupt is enabled.
  * @rmtoll IRQ_ENABLE     AWD_IRQ_ENA     LL_ADC_IsEnabledIT_AWD
  * @param  ADCx ADC instance
  * @retval 0: The interrupt is not enabled, 1: The interrupt is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_AWD(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_AWD_IRQ_ENA) == (ADC_IRQ_ENABLE_AWD_IRQ_ENA)) ? 1UL : 0UL);
}


/**
  * @brief  Enable the End Of a Sequence of conversion interrupt.
  * @rmtoll IRQ_ENABLE     EOS_IRQ_ENA     LL_ADC_EnableIT_EOS
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_EnableIT_EOS(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EOS_IRQ_ENA);
}


/**
  * @brief  Disable the End Of a Sequence of conversion interrupt.
  * @rmtoll IRQ_ENABLE     EOS_IRQ_ENA     LL_ADC_DisableIT_EOS
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DisableIT_EOS(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EOS_IRQ_ENA);
}


/**
  * @brief  Check if the End Of a Sequence of conversion interrupt is enabled.
  * @rmtoll IRQ_ENABLE     EOS_IRQ_ENA     LL_ADC_IsEnabledIT_EOS
  * @param  ADCx ADC instance
  * @retval 0: The interrupt is not enabled, 1: The interrupt is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_EOS(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EOS_IRQ_ENA) == (ADC_IRQ_ENABLE_EOS_IRQ_ENA)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the End Of a Down Sampler conversion interrupt.
  * @rmtoll IRQ_ENABLE     EODS_IRQ_ENA     LL_ADC_EnableIT_EODS
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_EnableIT_EODS(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EODS_IRQ_ENA);
}


/**
  * @brief  Disable the End Of a Down Sampler conversion interrupt.
  * @rmtoll IRQ_ENABLE     EODS_IRQ_ENA     LL_ADC_DisableIT_EODS
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DisableIT_EODS(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EODS_IRQ_ENA);
}


/**
  * @brief  Check if the End Of a Down Sampler conversion interrupt is enabled.
  * @rmtoll IRQ_ENABLE     EODS_IRQ_ENA     LL_ADC_IsEnabledIT_EODS
  * @param  ADCx ADC instance
  * @retval 0: The interrupt is not enabled, 1: The interrupt is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_EODS(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EODS_IRQ_ENA) == (ADC_IRQ_ENABLE_EODS_IRQ_ENA)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the End Of Conversion interrupt.
  * @rmtoll IRQ_ENABLE     EOC_IRQ_ENA     LL_ADC_EnableIT_EOC
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_EnableIT_EOC(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EOC_IRQ_ENA);
}


/**
  * @brief  Disable the End Of Conversion interrupt.
  * @rmtoll IRQ_ENABLE     EOC_IRQ_ENA     LL_ADC_DisableIT_EOC
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_DisableIT_EOC(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EOC_IRQ_ENA);
}


/**
  * @brief  Check if the End Of Conversion interrupt is enabled.
  * @rmtoll IRQ_ENABLE     EOC_IRQ_ENA     LL_ADC_IsEnabledIT_EOC
  * @param  ADCx ADC instance
  * @retval 0: The interrupt is not enabled, 1: The interrupt is enabled.
  */
__STATIC_INLINE uint32_t LL_ADC_IsEnabledIT_EOC(const ADC_TypeDef *ADCx)
{
  return ((READ_BIT(ADCx->IRQ_ENABLE, ADC_IRQ_ENABLE_EOC_IRQ_ENA) == (ADC_IRQ_ENABLE_EOC_IRQ_ENA)) ? 1UL : 0UL);
}

/**
  * @}
  */


