stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_adc.h
/** @defgroup ADC_LL_EF_Delay_Setting ADC Dealy Setting
  * @{
  */

#if defined(ADC_TIMER_CONF_VBIAS_PRECH_DELAY)
/**
  * @brief  Set the duration of a waiting time starting at rising edge of
  *         PGA_EN signal and corresponding to the VBIAS precharge duration.
  *         The time unit is 4 us. Max delay is 1.02 ms, default value is 128 us.
  * @note   The minimum recommended value for this bitfield is 150 to have 600 us.
  * @rmtoll TIMER_CONF     VBIAS_PRECH_DELAY       LL_ADC_SetVbiasPrechargeDelay
  * @param  ADCx ADC instance
  * @param  Delay This parameter is a 8-bit value.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetVbiasPrechargeDelay(ADC_TypeDef *ADCx, uint32_t Delay)
{
  MODIFY_REG(ADCx->TIMER_CONF, ADC_TIMER_CONF_VBIAS_PRECH_DELAY, Delay << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos);
}


/**
  * @brief  Get the duration of a waiting time starting at rising edge of
  *         PGA_EN signal and corresponding to the VBIAS precharge duration.
  *         The time unit is 4 us. Max delay is 1.02 ms.
  * @note   The minimum recommended value for this bitfield is 150 to have 600 us.
  * @rmtoll TIMER_CONF     VBIAS_PRECH_DELAY       LL_ADC_GetVbiasPrechargeDelay
  * @param  ADCx ADC instance
  * @retval Returned value is a 8-bit value.
  */
__STATIC_INLINE uint32_t LL_ADC_GetVbiasPrechargeDelay(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->TIMER_CONF, ADC_TIMER_CONF_VBIAS_PRECH_DELAY));
}

/**
  * @brief  Enable the 1024x prescaler used to compute the duration of VBIAS
  *         precharge duration
  * @note   The time unit is 4 us with prescaler disabled.
  *         The time unit is 4096 us with prescaler enabled.
  * @rmtoll TIMER_CONF     PRECH_DELAY_SEL       LL_ADC_VbiasPrechargeDelayPrescalerEnable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_VbiasPrechargeDelayPrescalerEnable(ADC_TypeDef *ADCx)
{
  SET_BIT(ADCx->TIMER_CONF, ADC_TIMER_CONF_PRECH_DELAY_SEL);
}

/**
  * @brief  Enable the 1024x prescaler used to compute the duration of VBIAS
  *         precharge duration
  * @note   The time unit is 4 us with prescaler disabled.
  *         The time unit is 4096 us with prescaler enabled.
  * @rmtoll TIMER_CONF     PRECH_DELAY_SEL       LL_ADC_VbiasPrechargeDelayPrescalerDisable
  * @param  ADCx ADC instance
  * @retval None
  */
__STATIC_INLINE void LL_ADC_VbiasPrechargeDelayPrescalerDisable(ADC_TypeDef *ADCx)
{
  CLEAR_BIT(ADCx->TIMER_CONF, ADC_TIMER_CONF_PRECH_DELAY_SEL);
}

#endif /* ADC_TIMER_CONF_VBIAS_PRECH_DELAY */

#if defined (ADC_TIMER_CONF_ADC_LDO_DELAY)
/**
  * @brief  Set the duration of the waiting time between the ADC_LDO enable and
  *         the ADC_ON, to let time to the LDO to stabilize itself before
  *         starting a conversion
  *         The time unit is 4 us. Max delay is 1.02 ms, default value is 160 us.
  * @rmtoll TIMER_CONF     ADC_LDO_DELAY       LL_ADC_SetADCLDODelay
  * @param  ADCx ADC instance
  * @param  Delay This parameter is a 8-bit value.
  * @retval None
  */
__STATIC_INLINE void LL_ADC_SetADCLDODelay(ADC_TypeDef *ADCx, uint32_t Delay)
{
  MODIFY_REG(ADCx->TIMER_CONF, ADC_TIMER_CONF_ADC_LDO_DELAY, Delay);
}


/**
  * @brief  Get the duration of the waiting time between the ADC_LDO enable and
  *         the ADC_ON, to let time to the LDO to stabilize itself before
  *         starting a conversion
  *         The time unit is 4 us. Max delay is 1.02 ms, default value is 160 us.
  * @rmtoll TIMER_CONF     ADC_LDO_DELAY       LL_ADC_GetADCLDODelay
  * @param  ADCx ADC instance
  * @retval Returned value is a 8-bit value.
  */
__STATIC_INLINE uint32_t LL_ADC_GetADCLDODelay(const ADC_TypeDef *ADCx)
{
  return (uint32_t)(READ_BIT(ADCx->TIMER_CONF, ADC_TIMER_CONF_ADC_LDO_DELAY));
}
#endif /* ADC_TIMER_CONF_ADC_LDO_DELAY */


/**
  * @}
  */


/** @defgroup ADC_LL_CALIB_CONVERSION ADC Calibration and Conversion functions
  * @{
  */


/**
  * @brief  Return the calibration value for the gain of
  *         single ended positive input at range 3.6 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINPX_3V6(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINPX_3V6) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         single ended positive input at range 3.6 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINPX_3V6(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINPX_3V6) >> 12UL);

  return (int8_t)calibration_offset;
}


/**
  * @brief  Return the calibration value for the gain of
  *         single ended positive input at range 2.4 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINPX_2V4(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINPX_2V4) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         single ended positive input at range 2.4 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINPX_2V4(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINPX_2V4) >> 12UL);

  return (int8_t)calibration_offset;
}


/**
  * @brief  Return the calibration value for the gain of
  *         single ended positive input at range 1.2 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE uint16_t LL_ADC_GET_CALIB_GAIN_FOR_VINPX_1V2(void)
{
  return (uint16_t)((*(uint32_t *)ADC_CALIB_ADDRESS_VINPX_1V2) & 0xFFFUL);
}


/**
  * @brief  Return the calibration value for the offset of
  *         single ended positive input at range 1.2 V.
  *         Use the function LL_ADC_ConfigureCalibPointX() with X = 1, 2, 3 or 4.
  * @retval Returned value to be put in COMP_X register if 0xFFFFFFFF means no calibration point.
  */
__STATIC_INLINE int8_t LL_ADC_GET_CALIB_OFFSET_FOR_VINPX_1V2(void)
{
  int8_t calibration_offset = ((*(uint32_t *)ADC_CALIB_ADDRESS_VINPX_1V2) >> 12UL);

